app/views/matches/_majscore.html.erb

SELECT "teams".* FROM "teams"
---
    <div class="w-4/5 flex justify-start ">
      <%=form.select :team_a_id, Team.all.collect {|team_a| [ team_a.name, team_a.id ] } %>

SELECT "teams".* FROM "teams"
---
    <div class="w-4/5 flex justify-start ">
      <%=form.select :team_b_id, Team.all.collect {|team_b| [ team_b.name, team_b.id ] } %>