app/controllers/matches_controller.rb

  def index
    @matchs = Match.all
---
SELECT "matches".* FROM "matches"

  def create
    @pool = set_pool
    @team = set_team
    if current_user.admin == true
      @match = current_user.matchs.build(match_params)
      if @match.save
---
INSERT INTO "matches" ("date", "team_a_id", "team_b_id", "pool_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if current_user.admin == true
      @match = set_match
      if @match.update(match_params)
---
UPDATE "matches" SET "date" = $1, "score_a" = $2, "score_b" = $3, "updated_at" = $4 WHERE "matches"."id" = $5  [["date", "2022-01-10 00:00:00"], ["score_a", 1], ["score_b", 1], ["updated_at", "2022-01-10 23:34:36.448630"], ["id", "e5216cf6-d0c5-467c-87d4-3160e8fd5be5"]]

  def set_pool
    @pool = Pool.find(params[:pool_id])
---
SELECT "pools".* FROM "pools" WHERE "pools"."id" = $1 LIMIT $2  [["id", "90f43130-e974-4a00-981d-211557671af0"], ["LIMIT", 1]]

  def set_team
    @team = Team.find(params[:team_id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", "a427b03b-e90f-4d51-b8fe-5174dd8ed37f"], ["LIMIT", 1]]