app/controllers/pools_controller.rb

SELECT "pools".* FROM "pools"
---
  def index
    @pools = Pool.all

SELECT "pools".* FROM "pools" WHERE "pools"."id" = $1 LIMIT $2  [["id", "6ad40a58-c24e-4d9b-9ee6-270496eeaf53"], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @pool = Pool.find(id)

INSERT INTO "pools" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-01-07 16:46:43.349614"], ["updated_at", "2022-01-07 16:46:43.349614"]]
---
  def create
    @pool = Pool.create(pool_params)

SELECT "pools".* FROM "pools" WHERE "pools"."id" = $1 LIMIT $2  [["id", "62d0037c-f997-4335-aa27-1cc55b9649d4"], ["LIMIT", 1]]
---
  def edit
    @pool = Pool.find(params[:id])

SELECT "pools".* FROM "pools" WHERE "pools"."id" = $1 LIMIT $2  [["id", "62d0037c-f997-4335-aa27-1cc55b9649d4"], ["LIMIT", 1]]
UPDATE "pools" SET "name" = $1, "updated_at" = $2 WHERE "pools"."id" = $3  [["name", "Pool z"], ["updated_at", "2022-01-07 17:21:46.449320"], ["id", "62d0037c-f997-4335-aa27-1cc55b9649d4"]]
---
  def update
    @pool = Pool.find(params[:id])
    if @pool.update(pool_params)