app/controllers/predictions_controller.rb

  def create
    @prediction = set_match.predictions.build(prediction_params.merge(user_id: current_user.id))
    if @prediction.save
---
INSERT INTO "predictions" ("score_a", "score_b", "match_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_pool
    @pool = Pool.find(params[:pool_id])
---
SELECT "pools".* FROM "pools" WHERE "pools"."id" = $1 LIMIT $2  [["id", "1de27947-0c36-455c-b0ab-645fecc71f3b"], ["LIMIT", 1]]

  def set_match
    @match = Match.find(params[:match_id])
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", "e5216cf6-d0c5-467c-87d4-3160e8fd5be5"], ["LIMIT", 1]]