app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "flag_url", "pool_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @team = pool.teams.build(team_params)
    # raise @pool.name.inspect
    if @team.save

SELECT "pools".* FROM "pools" WHERE "pools"."id" = $1 LIMIT $2  [["id", "62d0037c-f997-4335-aa27-1cc55b9649d4"], ["LIMIT", 1]]
---
  def pool
    @pool = Pool.find(params[:pool_id])